Repository: NachtsternBuild/fastboot-assistant
Catalog: src/po/*.po
Languages: de

source: 1. MagiskSU: Provision of root access for applications. 2. Magisk Modules: Change read-only partitions by installing modules.
de: 1. MagiskSU: Bereitstellung von Root-Zugriff für Anwendungen. 2. Magisk Module: Ändern Sie schreibgeschützte Partitionen durch die Installation von Modulen.

source: 3. MagiskBoot: The most comprehensive tool for unpacking and repacking Android boot images. 4. Zygisk: Execute code in all processes of Android applications.
de: 3. MagiskBoot: Das umfassendste Tool zum Entpacken und Wiederverpacken von Android-Boot-Images. 4. Zygisk: Führen Sie Code in allen Prozessen von Android-Anwendungen aus.

source: Rooting via Magisk
de: Rooten via Magisk

source: 1. Install the Magisk APK on your device. 2. Start Magisk on your device and select Install Magisk.
de: 1. Installieren Sie die Magisk-APK auf Ihrem Gerät. 2. Starten Sie Magisk auf Ihrem Gerät und wählen Sie 'Magisk installieren'.

source: 3. Select a boot image for your device and have it patched by Magisk (Usually the boot images can be found on the Internet. Caution is advised here).
de: 3. Wählen Sie ein Boot-Image für Ihr Gerät aus und lassen Sie es von Magisk patchen.(In der Regel finden Sie die Boot-Images im Internet. Seien Sie dabei vorsichtig hier).

source: 4. Copy the boot image patched by Magisk to your computer. 5. Rename the image to boot.img or let the application prepare it.
de: 4. Kopieren Sie das von Magisk gepatchte Boot-Image auf Ihren Computer. 5. Benennen Sie das Image in boot.img um oder lassen Sie es von der Anwendung vorbereiten.

source: 6. Start your device to Fastboot. 7. Flash the boot image for your device type. 8. Reboot your device. Now Magisk should provide root privileges.
de: 6. Starten Sie Ihr Gerät im Fastboot-Modus. 7. Flashen Sie das Boot-Image für Ihren Gerätetyp. 8. Starten Sie Ihr Gerät neu. Nun sollte Magisk Root-Rechte bereitstellen.

source: Custom ROMs are modified versions of Android to offer additional functions, performance improvements or a different user interface.
de: Custom-ROMs sind modifizierte Versionen von Android, die zusätzliche Funktionen, Leistungsverbesserungen oder eine andere Benutzeroberfläche bieten.

source: They replace the pre-installed Android and often contain newer software versions or special customizations that the manufacturer does not offer.
de: Sie ersetzen das vorinstallierte Android und enthalten oft neuere Softwareversionen oder spezielle Anpassungen, die der Hersteller nicht anbietet.

source: Custom ROM flashing
de: Flashen Custom-ROMs

source: 1. Download a custom ROM for your device. 2. Boot your device into fastboot mode. 3. Unlock the bootloader.
de: 1. Laden Sie ein benutzerdefiniertes ROM für Ihr Gerät herunter. 2. Starten Sie Ihr Gerät im Fastboot-Modus. 3. Entsperren Sie den Bootloader.

source: 4. Flash the custom recovery, the boot image (boot.img/init_boot.img), if necessary the dtbo.img. 5. Perform a reboot in the recovery.
de: 4. Flashen Sie die benutzerdefinierte Wiederherstellung, das Boot-Image (boot.img/init_boot.img), falls erforderlich, die dtbo.img. 5. Führen Sie einen Neustart in der Wiederherstellung durch.

source: 6. Copy the zip of the custom ROM to your device. 7. Tap install and flash the zip.
de: 6. Kopieren Sie die ZIP-Datei des benutzerdefinierten ROMs auf Ihr Gerät. 7. Tippen Sie auf 'Installieren' und flashen Sie die ZIP-Datei.

source: 8. Optionally you can now flash Magisk (as a zip) or Google services (only if your custom ROM does not contain any). 9. Restart your device.
de: 8. Optional können Sie nun Magisk (als ZIP-Datei) oder Google-Dienste (nur, wenn Ihr Custom-ROM keine enthält) flashen. 9. Starten Sie Ihr Gerät neu.

source: Welcome to the Fastboot Assistant!
de: Willkommen beim Fastboot-Assistant!

source: Let's get everything set up together.
de: Lassen Sie uns alles gemeinsam vorbereiten.

source: Here you can set important preferences for your Fastboot Assistant.
de: Hier können Sie wichtige Einstellungen für Ihren Fastboot Assistant vornehmen.

source: Choose folder for flashing files
de: Auswählen des Ordners für Flash Dateien

source: To work correctly, the Fastboot Assistant needs to perform some initial setup.
de: Damit der Fastboot Assistant ordnungsgemäß funktioniert, muss zunächst eine Einrichtung durchgeführt werden.

source: 1. Creating all required folders
de: 1. Erstellen der benötigten Ordner

source: 2. Adjusting the system environment
de: 2. Anpassungen an die System-Umgebung

source: Configuration completed.
de: Konfiguration abgeschlossen.

source: Use
de: Nutzung

source: 1. Please read the manual and documentation before using the program.
de: 1. Bitte lesen Sie vor der Verwendung des Programms die Anleitung und die Dokumentation.

source: 2. Always copy all images to be flashed into the 'ROM-Install' folder.
de: 2. Kopieren Sie immer alle zu flashenden Bilder in den Ordner 'ROM-Install'.

source: 3. If flashing Samsung devices, always use 'heimdall'.
de: 3. Verwenden Sie beim Flashen von Samsung-Geräten immer die Option 'heimdall'.

source: 4. Check regularly for Fastboot-Assistant updates.
de: 4. Überprüfen Sie regelmäßig, ob Updates für Fastboot-Assistant verfügbar sind.

source: Have fun with the Fastboot-Assistants!
de: Viel Spaß mit den Fastboot-Assistant!

source: The setup is complete. The Fastboot-Assistant is now ready.
de: Setup beendet. Der Fastboot-Assistant ist jetzt bereit.

source: Finished
de: Beendet
