Repository: NachtsternBuild/fastboot-assistant
Catalog: src/po/*.po
Languages: de

source: Image file '%s' not found.
de: Image '%s' nicht gefunden.

source: No device detected.
de: Kein Gerät gefunden.

source: Flashing %s ...
de: Flashen %s ...

source: Error: Target did not report max-download-size.
de: Fehler: Target hat keine maximale Download-Größe angegeben.

source: Error: A general error occurred. Check the log for details.
de: Fehler: Ein allgemeiner Fehler ist aufgetreten. Details finden Sie im Protokoll.

source: Error: Invalid sparse file format. Please check the image.
de: Fehler: Ungültiges Sparse-Dateiformat. Bitte überprüfen Sie das Bild.

source: Error: Writing to partition 'system' failed. Check the device and connection.
de: Fehler: Das Schreiben auf die Partition 'system' ist fehlgeschlagen. Überprüfen Sie das Gerät und die Verbindung.

source: Error: Resizing partition 'system' failed.
de: Fehler: Die Größenänderung der Partition 'system' ist fehlgeschlagen.

source: Error: Resizing partition 'system_a' failed.
de: Fehler: Die Größenänderung der Partition 'system_a' ist fehlgeschlagen.

source: Error: The specified partition was not found. Please check the partition.
de: Fehler: Die angegebene Partition wurde nicht gefunden. Bitte überprüfen Sie die Partition.

source: Error: The connection to Fastboot has expired. Please check the device and USB connection.
de: Fehler: Die Verbindung zu Fastboot ist abgelaufen. Bitte überprüfen Sie das Gerät und die USB-Verbindung.

source: Error: No authorization to execute fastboot command. Please try as root.
de: Fehler: Keine Berechtigung zum Ausführen des Fastboot-Befehls. Bitte versuchen Sie es als Root.

source: Error: The device is locked. Please unlock the bootloader and try again.
de: Fehler: Das Gerät ist gesperrt. Bitte entsperren Sie den Bootloader und versuchen Sie es erneut.

source: Error: The operation is not permitted. Please check the device.
de: Fehler: Der Vorgang ist nicht zulässig. Bitte überprüfen Sie das Gerät.

source: Error: The command is not allowed.
de: Fehler: Der Befehl ist nicht zulässig.

source: Error: File or directory not found. Please check path and file.
de: Fehler: Datei oder Verzeichnis nicht gefunden. Bitte überprüfen Sie den Pfad und die Datei.

source: Error: Image could not be loaded. Please check the file.
de: Fehler: Das Bild konnte nicht geladen werden. Bitte überprüfen Sie die Datei.

source: Error: Unknown partition. Please check partition.
de: Fehler: Unbekannte Partition. Bitte überprüfen Sie die Partition.

source: Image file not found.
de: Image nicht gefunden.

source: ✅ Bootctl detected.
de: ✅ Bootctl aktiv.

source: ❌ Bootctl not detected.
de: ❌ Bootctl nicht aktiv.

source: ✅ Root permissions available.
de: ✅ Root Rechte verfügbar.

source: ❌ No root permissions available.
de: ❌ Root Rechte nicht verfügbar.

source: Partitions
de: Partitionen

source: Creating partition...
de: Erstelle Partitionen...

source: Creat Partition
de: Erstelle Partition

source: Enter the partition size:
de: Eingabe Partitionsgröße:

source: Partition Size:
de: Partitions Größe:

source: Confirm
de: Bestätigen

source: Cancel
de: Abbrechen

source: Resizing partition...
de: Partitionsgröße ändern...

source: Resize Partition
de: Partitionsgröße ändern

source: Removing partition...
de: Lösche Partition...

source: Log Viewer
de: Log

source: Show Log
de: Log anziegen

source: Exit
de: Verlassen

source: Documentation
de: Dokumentation

source: Fonts
de: Schriftarten

source: Special thanks to
de: Besonderen Dank an

source: Error
de: Fehler

source: Completed.
de: Beendet.

source: Device Name:
de: Gerät-name:

source: Active Slot:
de: Aktiver Slot:

source: Root Access:
de: Root-Rechte:

source: Check for root permissions...
de: Prüfe auf Root-Rechte...

source: System and Package Informations:
de: System- und Packetinformationen:

source: Package Informations:
de: Packet Informationen:

source: Processor:
de: Prozessor:

source: Graphics card:
de: Grafikkarte:

source: Language:
de: Sprache:

source: Predefined images
de: Vordefinierte Images

source: Images in the directory
de: Images im Verzeichnis

source: Back
de: Zurück

source: Flash Recovery
de: Recovery flashen

source: Flash Boot
de: Boot flashen

source: Flash Vendor
de: Vendor flashen

source: Flash payload.zip
de: Payload.zip flashen

source: Flash System
de: System flashen

source: Flash vbmeta/dtbo
de: vbmeta/dtbo flashen

source: Flash Preloader
de: Bootloader flashen

source: Flash Nutzerdaten
de: Nutzerdaten flashen

source: Flash Other Images
de: Andere Images flashen

source: Back to Home
de: Zurück zur Startseite

source: Boot (heimdall)
de: Boot (heimall)

source: Userdata
de: Nutzerdaten

source: Userdata (heimdall)
de: Nutzerdaten (Heimdall)

source: preloader.bin (heimdall)
de: prelaoder.bin (Heimdall)

source: vbmeta
de: vbemta

source: Flashing...
de: Flashen...

source: Erasing old files...
de: Lösche alte Dateien...

source: System (inactive)
de: System (Inaktiv)

source: Flashing gz.img...
de: Flashe gz.img...

source: Flashing lk.img...
de: Flashe lk.img...

source: Flashing logo.img...
de: Flashe logo.img...

source: Flashing md1img.img...
de: Flashe md1img.img...

source: Flashing metadata.img...
de: Flashe metadata.img...

source: Flashing protect.img...
de: Flashe protect.img...

source: Flashing scp.img...
de: Flashe scp.img...

source: Flashing spmfw.img...
de: Flashe spmfw.img...

source: Flashing sspm.img...
de: Flashe sspm.img...

source: Flashing tee.img...
de: Flashe tee.img...

source: Fastboot Flashing
de: Fastboot Flash

source: This may take some time...
de: Dies kann einige Zeit dauern...

source: Erasing files...
de: Lösche Dateien...

source: Devices
de: Geräte

source: Reboot Device
de: Gerät Neustarten

source: Settings
de: Einstellungen

source: Prepare Flashing
de: Flashen Vorbereiten

source: Instructions
de: Anleitungen

source: About
de: Über das Programm

source: Desvices (ADB)
de: Geräte (ADB)

source: Devcies (fastboot)
de: Geräte (Fastboot)

source: Devices in ADB
de: Geräte über ADB

source: Devices in Fastboot
de: Geräte über Fastboot

source: Setting slot
de: Setze Slot

source: Please wait...
de: Bitte warten...

source: Set 'a'
de: Setze 'a'

source: Set 'b'
de: Setze 'b'

source: Set slot auto
de: Setze Slot Automatisch

source: Delete Boot
de: Lösche Boot

source: Delete Vendor
de: Lösche Vendor

source: Delete System
de: Lösche System

source: Resize Boot
de: Größe Ändern Boot

source: Resize Vendor
de: Größe Ändern Vendor

source: Resize System
de: Größe Ändern System

source: Create Boot
de: Erstelle Boot

source: Create Vendor
de: Erstelle Boot

source: Create System
de: Erstelle System

source: Unlocking Bootloader
de: Öffne Bootloader

source: Locking Bootloader
de: Schließe Bootloader

source: Unlock (new)
de: Öffnen (Neu)

source: Unlock (old)
de: Öffnen (Alt)

source: Lock
de: Schließen

source: Decompressing File
de: Dateien Dekomprimieren

source: Decompress (xz)
de: Dekomprimieren (XZ)

source: Prepare files
de: Dateien vorbereiten

source: Delete user data
de: Nutzerdaten Löschen

source: Set active slot
de: Setze aktiven Slot

source: Partitioning
de: Partitionieren

source: Backup with root
de: Backup mit Root

source: Backup without root
de: Backup ohne Root

source: Install Depends
de: Installiere Abhängigkeiten

source: Downloading Backup Tool
de: Downloade Backup Tools

source: Prepare
de: Vorbereiten

source: Download
de: Downloaden

source: Start
de: Starten

source: Erasing Userdata
de: Nutzerdaten Löschen

source: Getting devices...
de: Gerät suchen...

source: Copy boot.img...
de: Boot.img kopieren...

source: Installing boot...
de: Installiere Boot...

source: Cleaning up...
de: Aufräumen...

source: Copy system.img...
de: System.img kopieren...

source: Installing system...
de: Installiere System...

source: Checking bootctl...
de: Prüfe auf Bootctl...

source: Setting active slot...
de: Setze aktiven Slot...

source: Rebooting device...
de: Gerät neustarten...

source: The Treble Updater only works with a/b devices. Root rights must be provided.
de: Der Treble Updater funktioniert nur mit a/b-Geräten. Root-Rechte müssen vorhanden sein.

source: The Treble Updater has the task of flashing a new boot/system image into the inactive slot and making it active.
de: Der Treble Updater hat die Aufgabe, ein neues Boot-/System-Image in den inaktiven Steckplatz zu flashen und ihn aktiv zu machen.

source: Root permission:
de: Root-Rechte:

source: Flash new boot image
de: Boot-Image flashen

source: Flash new system image
de: System-Image flashen

source: Alternative for slot change (not recommended)
de: Alternative für Slot Wechsel (nicht empfohlen)

source: Start Flash
de: Starte Flash

source: Ready!
de: Fertig!

source: Old files
de: Alte Dateien

source: Configuration
de: Konfiguration

source: Running configuration...
de: Konfigurationen ausführen...

source: Create folder
de: Ordner erstellen

source: Configure
de: Konfigurieren

source: System Informations
de: System-Informationen

source: Define new directory
de: Neues Verzeichnis festlegen

source: Fastboot-Assistant Updater
de: Updater

source: Update check failed.
de: Update Prüfung fehlgeschlagen

source: No updates available.
de: Keine Updates verfügbar

source: Update to version %s available.
de: Update auf Version %s verfügbar.

source: Error downloading the package.
de: fehler beim Downloaden des Pakets

source: Rebooting
de: Neustarten

source: Reboot System
de: System neustarten

source: Reboot Image(.img)
de: Ins Image(.img) booten

source: Rebooting Recovery
de: Neustart Recovery

source: Restart ADB
de: Neustart ADB

source: Restarting Fastboot
de: Neustart Fastboot

source: Rebooting Bootloader
de: Neustart Bootloader

source: Fastboot help
de: Fastboot Hilfe

source: Bootloader variables
de: Bootloader Daten

source: Reboot Fastboot
de: Neustart Fastboot

source: Reboot
de: Neustart

source: Reboot Recovery
de: Neustart Recovery

source: Reboot (heimdall)
de: Neustart (Heimdall)

source: Rebooting Download
de: Neustart Download-Modus

source: Please note that your device is in download mode!
de: Bitte beachten Sie, dass sich Ihr Gerät im Download-Modus befindet!

source: Restart in Download
de: Neustart in Download

source: Help
de: Hilfe

source: Output pit
de: Pit ausgeben

source: Rooting
de: Rooten

source: Generic System Image (GSI)
de: Generisches System Image (GSI)

source: Others
de: Andere

source: Next
de: Weiter

source: This is a partition which is stored in the device tree of the device. This is essential for the communication of the hardware with the boot loader and the kernel.
de: Dies ist eine Partition, die im Gerätebaum des Geräts gespeichert ist. Sie ist für die Kommunikation der Hardware mit dem Bootloader und dem Kernel unerlässlich.

source: 'vbmeta' ensures that the boot process of Stock-Android runs safely. Some custom ROMs can only be started if a new vbmeta image has been flashed.
de: 'vbmeta' stellt sicher, dass der Startvorgang von Stock-Android sicher abläuft. Einige benutzerdefinierte ROMs können nur gestartet werden, wenn ein neues vbmeta-Image geflasht wurde.

source: Everything labeled 'Vendor' are manufacturer- or device-specific components of the operating system. Changes to these can lead to problems.
de: Alle mit 'Vendor' gekennzeichneten Komponenten sind hersteller- oder gerätespezifische Komponentendes Betriebssystems. Änderungen daran können zu Problemen führen.

source: The VNDK version (Vendor Native Development Kit) is a collection of libraries and guidelines that separates the hardware-specific part from the rest of Android.
de: Die VNDK-Version (Vendor Native Development Kit) ist eine Sammlung von Bibliotheken und Richtlinien, die den hardwarespezifischen Teil vom Rest von Android trennen.

source: This makes updates and maintenance easier because manufacturer-specific adjustments do not affect the compatibility and stability of the Android system.
de: Dies erleichtert Updates und Wartungsarbeiten, da herstellerspezifische Anpassungen keinen Einfluss auf die Kompatibilität und Stabilität des Android-Systems haben.

source: The backup serves to protect you from data loss and is recommended before every flash operation. There are two types of backup:
de: Die Sicherung dient dazu, Sie vor Datenverlust zu schützen, und wird vor jedem Flash-Vorgang empfohlen. Es gibt zwei Arten von Sicherungen:

source: 1. The backup with root. 2. The backup without root. When backing up with root, the partitions are copied as images and can be flashed again later.
de: 1. Die Sicherung mit Root-Rechten. 2. Die Sicherung ohne Root-Rechte. Bei der Sicherung mit Root-Rechten werden die Partitionen als Images kopiert und können später erneut geflasht werden.

source: 'Open Android Backup' is used for backups without root. It is an open source tool for Linux.
de: 'Open Android Backup' wird für Backups ohne Root-Zugriff verwendet. Es handelt sich um ein Open-Source-Tool für Linux.

source: Preparation Flash
de: Vorbereitungen Flash

source: 1. Provide more detailed information about your device and the chipset of the device. 2. Search for corresponding custom ROMs, custom recoverys or GSIs.
de: 1. Geben Sie detailliertere Informationen zu Ihrem Gerät und dem Chipsatz des Geräts an. 2. Suchen Sie nach entsprechenden benutzerdefinierten ROMs, benutzerdefinierten Wiederherstellungen oder GSIs.

source: 3. Check the availability of Project Treble for your device. 4. Check which partitioning scheme is available on your device (a/b-devices or only-a-devices).
de: 3. Überprüfen Sie die Verfügbarkeit von Project Treble für Ihr Gerät. 4. Überprüfen Sie, welches Partitionierungsschema auf Ihrem Gerät verfügbar ist (a/b-Geräte oder nur-a-Geräte).

source: 7. Read the developer's instructions before using Flash. 8. Copy all files that are flashed to: '~/Downloads/ROM-Install/'
de: 7. Lesen Sie die Anweisungen des Entwicklers, bevor Sie Flash verwenden. 8. Kopieren Sie alle geflashten Dateien nach: '~/Downloads/ROM-Install/'

source: Some custom ROMs
de: Einige Custom-ROMs

source: TWRP (a recovery)
de: TWRP (Recovery)

source: Dealing with ADB
de: Umgang mit ADB

source: Flashing Images
de: Images Flashen

source: Preparations
de: Vorbereitungen

source: ADB (Android Debug Bridge) serves as a communication interface between a computer and an Android device. It is used for debugging and file transfer.
de: ADB (Android Debug Bridge) dient als Kommunikationsschnittstelle zwischen einemComputer und einem Android-Gerät. Es wird zum Debuggen und zur Dateiübertragung verwendet.

source: Fastboot is a command line tool for the bootloader of Android devices, with which user-defined firmware and other system images can be flashed.
de: Fastboot ist ein Befehlszeilentool für den Bootloader von Android-Geräten, mit dem benutzerdefinierte Firmware und andere System-Images geflasht werden können.

source: Both tools are very useful for developers and advanced users when it comes to modifying and diagnosing Android devices.
de: Beide Tools sind für Entwickler und fortgeschrittene Nutzer sehr nützlich, wenn es darum geht, Android-Geräte zu modifizieren und zu diagnostizieren.

source: The bootloader is a program that loads the operating system when an Android device is started and checks whether the software is secure and authorized.
de: Der Bootloader ist ein Programm, das beim Start eines Android-Geräts das Betriebssystem lädt und überprüft, ob die Software sicher und autorisiert ist.

source: This allows custom ROMs and other image files to be flashed.
de: Dadurch können Custom-ROMs und andere Image-Dateien geflasht werden.

source: Connect with ADB
de: Verbinden über ADB

source: Connect your device to your computer. 1.Enable developer options. 1.1. Search for 'Build number' in the settings.
de: Verbinden Sie ihr Gerät mit ihrem Computer 1.Entwickleroptionen aktivieren. 1.1. Suchen sie nach 'Build-Nummer'.

source: 2. Use the program to check whether there is a connection to the ADB.
de: 2. Überprüfen Sie mit dem Programm, ob eine Verbindung zum ADB besteht.

source: 1. Navigate in the application through 'Reboot device' to 'Reboot from ADB'.
de: 1. Navigieren Sie in der Anwendung über 'Gerät neustarten' zu 'Von ADB neu starten'.

source: 2. Wait until your device is in fastboot mode.
de: 2. Warten Sie, bis sich Ihr Gerät im Fastboot-Modus befindet.

source: 3. Check whether there is a connection to fastboot mode.
de: 3. Überprüfen Sie, ob eine Verbindung zum Fastboot-Modus besteht.

source: Notes
de: Hinweise

source: GSI (Generic System Image) is an Android system image that requires support for Project Treble (see further information).
de: GSI (Generic System Image) ist ein Android-System-Image, das Unterstützung für Project Treble erfordert (siehe weitere Informationen).

source: GSI enable Android devices without custom ROMs support manual flashing of newer Android versions.
de: GSI ermöglicht Android-Geräten ohne benutzerdefinierte ROMs das manuelle Flashen von neueren Android-Versionen.

source: GSI Flashing
de: GSI Flashen

source: 1. Check if your device is compatible with Project Treble. 2. Download a corresponding GSI. 3. Prepare the images for the Flash.
de: 1. Überprüfen Sie, ob Ihr Gerät mit Project Treble kompatibel ist. 2. Laden Sie eine entsprechende GSI herunter. 3. Bereiten Sie die Images für den Flash vor.

source: 4. Boot your device in Fastboot. 5. Open the bootloader. Some devices do not support the Fastboot method.
de: 4. Starten Sie Ihr Gerät im Fastboot-Modus. 5. Öffnen Sie den Bootloader. Einige Geräte unterstützen die Fastboot-Methode nicht.

source: The alternatives 'dirty flash'(1) and 'clean flash'(2) are available as flash methods.
de: Die Alternativen 'Dirty Flash' (1) und 'Clean Flash' (2) sind als Flash-Methoden verfügbar.

source: 1. Delete all user data. 2. Flash the system image 3. If necessary, flash a vbmeta.img. 4. Restart your device.
de: 1. Löschen Sie alle Benutzerdaten. 2. Flashen Sie das System-Image. 3. Flashen Sie gegebenenfalls eine vbmeta.img-Datei. 4. Starten Sie Ihr Gerät neu.

source: After a 'dirty flash', the user data is retained, but not every GSI starts afterwards.
de: Nach einem 'Dirty Flash' bleiben die Benutzerdaten erhalten, aber nicht jede GSI startet danach neu.

source: 1. Flash the system image. 2. Restart your device.
de: 1. Flashen Sie das System-Image. 2. Starten Sie ihr Gerät neu.

source: Project Treble is an Android initiative from Google that separates the operating system and hardware components.
de: Project Treble ist eine Android-Initiative von Google, die das Betriebssystem und die Hardwarekomponenten voneinander trennt.

source: This makes it easier for manufacturers to provide updates while the OS is independent of chipset-specific drivers.
de: Dies erleichtert es den Herstellern, Updates bereitzustellen, während das Betriebssystem unabhängig von chipsatzspezifischen Treibern ist.

source: a/b Partitioning
de: a/b-Partitionierung

source: The A/B partitioning scheme uses two system partitions for seamless updates by switching the slot, provides higher security and continuous operation.
de: Das A/B-Partitionierungsschema verwendet zwei Systempartitionen für nahtlose Updates.Durch das Umschalten des Steckplatzes werden höhere Sicherheit und kontinuierlicher Betrieb gewährleistet.

source: The Only-A scheme has only one partition, allows easier management, but is more prone to errors during the update.
de: Das Only-A-Schema hat nur eine Partition, ermöglicht eine einfachere Verwaltung, ist jedoch anfälliger für Fehler während der Aktualisierung.

source: System-as-root is an Android mechanism in which the system image is mounted as the root file system.
de: System-as-root ist ein Android-Mechanismus, bei dem das System-Image als Root-Dateisystem gemountet wird.

source: This improves the separation of system and vendor partitions, increases security and facilitates system updates and the management of authorizations.
de: Dies verbessert die Trennung von System- und Anbieterpartitionen, erhöht die Sicherheit und erleichtert Systemaktualisierungen und die Verwaltung von Berechtigungen.

source: The kernel forms the interface between hardware, applications and the rest of the system and ensures secure and efficient execution.
de: Der Kernel bildet die Schnittstelle zwischen Hardware, Anwendungen und dem Rest des Systems und gewährleistet eine sichere und effiziente Ausführung.

source: Android versions are only compatible with certain Kernel versions; if incompatible, Android will not start.
de: Android-Versionen sind nur mit bestimmten Kernel-Versionen kompatibel; bei Inkompatibilität startet Android nicht.

source: Prepare images
de: Vorbereiten Images

source: Recovery mode is a special boot menu on Android devices that is used to maintain and restore the system.
de: Der Recoverymodus ist ein spezielles Startmenü auf Android-Geräten, das zur Wartung und Wiederherstellung des Systems verwendet wird.

source: This enables functions such as resetting to factory settings, installing updates and some other basic functions to restore the system.
de: Dadurch werden Funktionen wie das Zurücksetzen auf die Werkseinstellungen, die Installation von Updates und einige andere grundlegende Funktionen zur Wiederherstellung des Systems ermöglicht.

source: Custom coverys have many more functions than the stock recoverys from the same manufacturer. These usually only have basic features on board.
de: Custom-Recoveries haben viel mehr Funktionen als die Stockrecoveries desselben Herstellers. Diese verfügen in der Regel nur über grundlegende Funktionen.

source: Flashing the recovery
de: Recovery Flashen

source: 1. Check whether there is a custom recovery for your device. 2. Download a corresponding recovery. 3. Prepare the images for the flash.
de: 1. Überprüfen Sie, ob es eine Custom-Recovery für Ihr Gerät gibt. 2. Laden Sie eine entsprechende Recvery herunter. 3. Bereiten Sie die Images für den Flash-Vorgang vor.

source: 4. Boot your device into fastboot mode. 5. Open the bootloader. Some devices do not support the fastboot method.
de: 4. Starten Sie Ihr Gerät im Fastboot-Modus. 5. Öffnen Sie den Bootloader. Einige Geräte unterstützen die Fastboot-Methode nicht.

source: Find out more about your chipset and the device. 6. Flash the recovery image with this application. 7. Boot your device into the recovery.
de: Erfahren Sie mehr über Ihren Chipsatz und das Gerät. 6. Flashen Sie das Recovery-Image mit dieser Anwendung. 7. Starten Sie Ihr Gerät im Recoverymodus.

source: When rooting Android devices, the user is granted superuser rights that give them full access to Android. This gives them the possibility to make far-reaching changes.
de: Beim Rooten von Android-Geräten erhält der Nutzer Superuser-Rechte, die ihm vollen Zugriff auf Android gewähren. Dies gibt ihm die Möglichkeit, weitreichende Änderungen vorzunehmen.

source: This allows you to remove pre-installed applications, change system settings and install special applications that require extended permissions.
de: Dadurch können Sie vorinstallierte Anwendungen entfernen, Systemeinstellungen ändern und spezielle Anwendungen installieren, die erweiterte Berechtigungen erfordern.

source: With the extensive rights, there are also great dangers while users and software can cause great damage to the software.
de: Mit den weitreichenden Rechten gehen auch große Gefahren einher, da Nutzer und Software der Software großen Schaden zufügen können.

source: Magisk is a package of open source software for Android customization. With the following components:
de: Magisk ist ein Paket mit Open-Source-Software zur Anpassung von Android. Mit den folgenden Komponenten:
